{
  "basics": {
    "name": "Earl Bingham",
    "label": "Software Developer",
    "summary": "I’m a full stack web developer who loves working with open source technology. I work best at planning the architecture of web  applications and their development life cycles. I also love to get the community involved and have had much experience with building and organizing large open source groups. Specialties: React, Redux, Javascript - Full stack developer with lots of experience in lots of stuff.",
    "website": "https://inmar.com",
    "email": "earlbingham@gmail.com",
    "location": {
      "city": "San Bruno",
      "countryCode": "US"
    },
    "profiles": [
      {
        "username": "earlbingham",
        "url": "https://twitter.com/earlbingham",
        "network": "twitter"
      },
      {
        "url": "https://github.com/earlbingham",
        "username": "earlbingham",
        "network": "github"
      }
    ]
  },
  "education": [
    {
      "endDate": "2017-01-01",
      "startDate": "2016-02-01",
      "area": "Data Science",
      "studyType": "Certificate",
      "institution": "John Hopkins University and Coursera"
    },
    {
      "endDate": "2009-12-12",
      "startDate": "2008-02-12",
      "area": "Computer Engineering",
      "studyType": "Bachelors",
      "institution": "California State University, Chico"
    }
  ],
  "references": [
    {
      "reference": "Earl’s work ethic and professionalism are second to none. Over the past year, Earl has worked on numerous projects for our government and Energy customers. During that time I have had the pleasure to see his support for building integration components and web applications that met our customer’s business goals on the projects. Earl was resourceful and helpful to our customers concerns and tight deadlines.",
      "name": "Sandy Zylka, VP Products & Technology at NextAxiom Technology, Inc."
    },
    {
      "reference": "Earl was terrific to work with. He has all the traits a good consultant would need: great with clients, well organized, super sharp technically, and always keeps a calm head.",
      "name": "Steve O'Donoghue, Head of Product Management at SocialTalent"
    },
    {
      "reference": "Having worked with Earl on aligning changes in our core systems with our customer service tools, I found Earl to be highly dedicated, meticulous, focused and an excellent partner. On other projects focused on the consumer experience around sign-up and account management, Earl had valuable insights based on his experience and was also able to validate assumptions using key metrics. I could always count on Earl to deliver on his commitments and would welcome the opportunity to work with him again.",
      "name": "Lars Smith, Independent Adventurer"
    },
    {
      "reference": "Earl and I worked closely on a number of engineering projects from initial design to product launch, including long term maintenance. From initial announcement, planning, and all the way through launch and maintenance Earl has proven capable and committed to all projects. These projects included websites used by millions of EA customers, as well as back-end financial applications used by legal and finance departments. Earl has a strong ability to understand numerous operational requirements and formulate them into engineering technical requirements to be used by outsourced engineering teams to develop our solutions. In addition, Earl possesses the tenacity to stick with a project and work the problems in order to make sure that our customers get the finest service available. It is not uncommon to see Earl working early morning hours and weekends to see that there are no bugs and projects launch to happy customers.",
      "name": "Frank Morales, Senior Risk Manager at Bethesda Softworks"
    }
  ],
  "skills": [
    {
      "keywords": [
        "HTML / JSX",
        "CSS / Styled Components",
        "Java"
      ],
      "level": "Senior",
      "name": "Backend"
    },
    {
      "keywords": [
        "Kafka",
        "SQl",
        "Oracle",
        "unix"
      ],
      "level": "Senior",
      "name": "Backend"
    },
    {
      "keywords": [
        "AWS",
        "Splunk",
        "Caching"
      ],
      "level": "Senior",
      "name": "Devops"
    }
  ],
  "work": [
    {
      "highlights": [
        "Working on enterprise java applications with web services",
        "Hosted on AWS EC2 servers",
        "Utilize Kafka and other open source technologies",
        "SQL, XML, JSON"
      ],
      "summary": "Inmar is a b2b integrator with in the CPG market",
      "website": "https://inmar.com",
      "company": "Inmar",
      "position": "Senior Software Developer",
      "startDate": "2016-02-01"
    },
    {
      "highlights": [
        "Based upon continuous new customer requirements, worked on UX changes to product configurations and assemblies that provide validation for missing components, ensuring quotes are ready to used for bid or order.",
"Developed channel and region-specific price list support. Including integrated worksheet management that lets sales reps adjust pricing and discounts for correct price calculations utilizing REST web services.",
"Lead development of proposals and submittal packages that consist of any number of dynamically-generated documents utilizing JSP and Struts.",
"Application development for customer implementations utilizing Spring MVC, Spring Web Services, Hibernate, and Google Web Toolkit.",
"Wrote custom publish and index catalog data utilizing web services high volume web applications with JEE 7 and Object Oriented Programming.",
"Lead development of automated test harness utilizing JUnit, TestNG, and Selenium.",
"Developed continuous performance analysis and design improvements with Spring JCache, lucene search in a multithreaded environment.",
"Database design and development of ETL data integration, meta data modeling.",
"Software used: JSP, Struts, Subversion, Eclipse, Hibernate, Postgres SQL, Mysql, SQL Server, JEE 7, Java JDK 1.6, Jersey, Spring MVC and Web Services, Google GWT, Apache Axis2, Ant, Jersey, Lucene, POI, and Xerces",
"Software Languages: Javascript, HTTP, HTML5, CSS3, SOAP, REST and AJAX"
      ],
      "summary": "Worked on some customer integrations and evaluation of potential customers",
      "website": "https://www.technicon.com",
      "company": "Technicon",
      "position": "Software Developer",
      "startDate": "2013-12-01",
      "endDate": "2015-01-01"
    },
    {
      "highlights": [
        "Javascript development utilizing AngularJS, Bootstrap, Ajax, CSS3, HTML5. Enhancing the NextAxiom hyperService Platform and software solutions. Working on select customer projects to provide rich quality of service solutions. Developing new features that utilize my experience with web services and front-end web design. Presented at SAP conference regarding Fiori UI design and integration to other enterprise applications."
      ],
      "summary": "Full stack development",
      "website": "http://www.nextaxiom.com",
      "company": "NextAxiom",
      "position": "Senior Software Developer",
      "startDate": "2015-01-08",
      "endDate": "2015-12-12"
    },
    {
      "highlights": [
        "User story agile development of new features for product utilizing JPA and ORM in a threaded environment. Fixed product bugs with runtime, installation, and patches. Mentioning developers onshore and offshore with new product development and fixing existing problems. Full product development life cycle utilizing tools such as ANT, Perl, and JUnit. I18N compatibility and Unicode support for UTF-8 and UTF-16 formats."
      ],
      "summary": "Worked on CRM backend and search",
      "website": "http://www.oracle.com",
      "company": "ORACLE",
      "position": "Developer",
      "startDate": "2013-02-01",
      "endDate": "2013-12-01"
    },
    {
      "highlights": [
        "Designed, developed, and implemented SOAP web service based service call wrappers used in high volume web applications.",
        "Wrote custom classifiers for Oracle Knowledge Search runtime. Implemented custom security SSL integration with LDAP repositories.",
        "Lead full lifecycle of product development of software implementations that required mentoring and bug fixing.",
        "Software used: Subversion, Eclipse, Junit, Easymock, Javascript, JSON, HTML 4/5, JSP, and shell scripts",
        "Oracle Software: Oracle Knowledge 8.4.2.2 and 8.5, Java JDK 1.6, Weblogic 12c, OBIEE 11.1, Jdeveloper, Shell Scripts"
      ],
      "summary": "Started off as a front end developer but took on the role of CTO in early 2013. The application frontend is built with Javascript and organized as a single page application that talks to a collection of Rails web servers which are connected to MongoDB.",
      "website": "http://www.ORACLE.com",
      "company": "Oracle",
      "position": "Senior Software Engineer",
      "endDate": "2010-01-09",
      "startDate": "2012-11-08"
    },
    {
      "summary": "HP",
      "website": "http://hp.com",
      "company": "HP",
      "position": "Device Driver Engineer",
      "endDate": "2012-06-01",
      "startDate": "2011-01-01"
    }
  ],
 "meta": {
    "theme": "elegant"
  }
}
